nxp-mcuxpresso/mcuxsdk-examples/_boards/imx943evk/modbus_examples/rtu/modbus_server/cm33_core1/pin_mux.h
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

 #ifndef _PIN_MUX_H_
 #define _PIN_MUX_H_
 
 #include "fsl_iomuxc.h"
 #include "board.h"
 
 /*!
  * @addtogroup pin_mux
  * @{
  */
 
 /***********************************************************************************************************************
  * API
  **********************************************************************************************************************/
 
 #if defined(__cplusplus)
 extern "C" {
 #endif
 
 /*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
 void BOARD_InitGPIOPins(void);                                 /*!< Function assigned for the core: undefined[cm33] */

 /*!
  * @brief Calls initialization functions.
  *
  */
 void BOARD_InitBootPins(void);
 
 /*!
  * @brief Configures pin routing and optionally pin electrical features.
  *
  */
 void BOARD_InitPins(void);                    /* Function assigned for the Cortex-M33 */
 
 #if defined(__cplusplus)
 }
 #endif
 
 /*!
  * @}
  */
 #endif /* _PIN_MUX_H_ */
 
 /***********************************************************************************************************************
  * EOF
  **********************************************************************************************************************/
 